Revit 2024 API
MultiServerService Class
 This class represents a multi-server service inside Revit application. It is created when an instance of IMultiServerService is registered with Revit.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class MultiServerService : ExternalService
Visual Basic
Public Class MultiServerService _
	Inherits ExternalService
Visual C++
public ref class MultiServerService : public ExternalService
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalService.ExternalService
 Autodesk.Revit.DB.ExternalService.MultiServerService
See Also
MultiServerService Members
Autodesk.Revit.DB.ExternalService Namespace